In [1]:
import pandas as pd

In [2]:
 #"Deep Water", "Blonde", "Anthena", "Prey", "John Wick" "Orphan First Kill"

Names = ['John', 'Chris', 'Wendy', 'Wallace', 'Julie']
Deep_Water = [1, 3, 5, 6, 0]
Blonde = [4, 5, 3, 4, 1]
Anthena = [2, 3, 4, 5, 0]
Prey = [1, 3, 4, 5, 5]
John_Wick = [5, 5, 3, 3, 0]
Orphan_First_Kill = [3, 3, 2, 2, 1]
        


Reviews = list(zip(Deep_Water, Blonde, Anthena, Prey, John_Wick, Orphan_First_Kill))

Reviews

[(1, 4, 2, 1, 5, 3),
 (3, 5, 3, 3, 5, 3),
 (5, 3, 4, 4, 3, 2),
 (6, 4, 5, 5, 3, 2),
 (0, 1, 0, 5, 0, 1)]

In [3]:
from pandas import DataFrame


df = DataFrame(data=Reviews, columns=['Deep Water', 'Blonde', 'Anthena', 'Prey', 'John Wick', 'Orphan First Kill'],
                                     index=['John', 'Chris', 'Wendy', 'Wallace', 'Julie'])

df

         Deep Water  Blonde  Anthena  Prey  John Wick  Orphan First Kill
John              1       4        2     1          5                  3
Chris             3       5        3     3          5                  3
Wendy             5       3        4     4          3                  2
Wallace           6       4        5     5          3                  2
Julie             0       1        0     5          0                  1

In [4]:
df.to_csv('MovieRatings.csv', index=False, header=True)

In [5]:
location = r'C:\Users\garci\OneDrive\Documents\IS362_week7\MovieRatings.csv'
Data = pd.read_csv(location)

Data

   Deep Water  Blonde  Anthena  Prey  John Wick  Orphan First Kill
0           1       4        2     1          5                  3
1           3       5        3     3          5                  3
2           5       3        4     4          3                  2
3           6       4        5     5          3                  2
4           0       1        0     5          0                  1

In [6]:
Data['Deep Water'].mean()
Data['Blonde'].mean()
Data['Anthena'].mean()
Data['Prey'].mean()
Data['John Wick'].mean()
Data['Orphan First Kill'].mean()

2.2

In [7]:
Data.describe()

       Deep Water    Blonde   Anthena     Prey  John Wick  Orphan First Kill
count     5.00000  5.000000  5.000000  5.00000    5.00000            5.00000
mean      3.00000  3.400000  2.800000  3.60000    3.20000            2.20000
std       2.54951  1.516575  1.923538  1.67332    2.04939            0.83666
min       0.00000  1.000000  0.000000  1.00000    0.00000            1.00000
25%       1.00000  3.000000  2.000000  3.00000    3.00000            2.00000
50%       3.00000  4.000000  3.000000  4.00000    3.00000            2.00000
75%       5.00000  4.000000  4.000000  5.00000    5.00000            3.00000
max       6.00000  5.000000  5.000000  5.00000    5.00000            3.00000

In [8]:
norm = (Data - Data.mean()) / (Data.max() - Data.min())

norm

   Deep Water  Blonde  Anthena  Prey  John Wick  Orphan First Kill
0   -0.333333    0.15    -0.16 -0.65       0.36                0.4
1    0.000000    0.40     0.04 -0.15       0.36                0.4
2    0.333333   -0.10     0.24  0.10      -0.04               -0.1
3    0.500000    0.15     0.44  0.35      -0.04               -0.1
4   -0.500000   -0.60    -0.56  0.35      -0.64               -0.6

In [9]:
norm.mean()

Deep Water           0.000000e+00
Blonde               2.220446e-17
Anthena              4.440892e-17
Prey                -2.220446e-17
John Wick           -2.220446e-17
Orphan First Kill   -8.881784e-17
dtype: float64

In [10]:
norm.max() - norm.min()

Deep Water           1.0
Blonde               1.0
Anthena              1.0
Prey                 1.0
John Wick            1.0
Orphan First Kill    1.0
dtype: float64